Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "4tfmup"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "datasets-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "otus0z"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "otus0z"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals will be created
  + resource "aws_api_gateway_method_response" "datasets-id-individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "8i72qo"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "8i72qo"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "7dagqd"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets_post will be created
  + resource "aws_api_gateway_method_response" "datasets_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "y3hb5m"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.dportal_proxy will be created
  + resource "aws_api_gateway_method_response" "dportal_proxy" {
      + http_method         = "ANY"
      + id                  = (known after apply)
      + resource_id         = "nam5qf"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.entry_types will be created
  + resource "aws_api_gateway_method_response" "entry_types" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "a88e4r"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.filtering_terms will be created
  + resource "aws_api_gateway_method_response" "filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "uds2w5"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants will be created
  + resource "aws_api_gateway_method_response" "g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "zfefrf"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id will be created
  + resource "aws_api_gateway_method_response" "g_variants-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "jhbvft"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "mvrw3g"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "mvrw3g"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "egwaf8"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "egwaf8"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "jhbvft"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants_post will be created
  + resource "aws_api_gateway_method_response" "g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "zfefrf"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals will be created
  + resource "aws_api_gateway_method_response" "individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "w6hskl"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "individuals-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "e1fux0"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "individuals-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "e1fux0"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id will be created
  + resource "aws_api_gateway_method_response" "individuals-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "j0lt7b"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "individuals-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "cm0ykk"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "cm0ykk"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "individuals-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "rtt1l7"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "rtt1l7"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "j0lt7b"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals_post will be created
  + resource "aws_api_gateway_method_response" "individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "w6hskl"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.info will be created
  + resource "aws_api_gateway_method_response" "info" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "7p4ge2"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.map will be created
  + resource "aws_api_gateway_method_response" "map" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "oio1wd"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.root-get will be created
  + resource "aws_api_gateway_method_response" "root-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "k9orycq4bf"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs will be created
  + resource "aws_api_gateway_method_response" "runs" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "zj9kwx"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "runs-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "ocbafw"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "runs-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "ocbafw"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id will be created
  + resource "aws_api_gateway_method_response" "runs-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "3a0k7f"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses will be created
  + resource "aws_api_gateway_method_response" "runs-id-analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "d6x3d0"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post will be created
  + resource "aws_api_gateway_method_response" "runs-id-analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "d6x3d0"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "runs-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "h7z0fn"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "runs-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "h7z0fn"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id_post will be created
  + resource "aws_api_gateway_method_response" "runs-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "3a0k7f"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs_post will be created
  + resource "aws_api_gateway_method_response" "runs_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "zj9kwx"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "wfavief721"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_settings.BeaconApi will be created
  + resource "aws_api_gateway_method_settings" "BeaconApi" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "wfavief721"
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = (known after apply)
          + metrics_enabled                            = (known after apply)
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 1000
          + throttling_rate_limit                      = 100
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be created
  + resource "aws_api_gateway_stage" "BeaconApi" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "wfavief721"
      + stage_name    = "prod"
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be created
  + resource "aws_athena_workgroup" "sbeacon-workgroup" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "query_workgroup"
      + state         = "ENABLED"
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + configuration {
          + enforce_workgroup_configuration    = false
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + engine_version {
              + effective_engine_version = (known after apply)
              + selected_engine_version  = "Athena engine version 3"
            }

          + result_configuration {
              + output_location = "s3://gaspi-metadata-20250523065512230500000001/query-results/"
            }
        }
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-index-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms_index"
        }
      + policy_body   = (known after apply)
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = jsonencode(
            {
              + Parameters = {
                  + DatabaseName = {
                      + Type = "String"
                    }
                  + TableName    = {
                      + Type = "String"
                    }
                }
              + Resources  = {
                  + SBeaconTermsGlueCatalogTable = {
                      + Properties = {
                          + CatalogId    = {
                              + Ref = "AWS::AccountId"
                            }
                          + DatabaseName = {
                              + Ref = "DatabaseName"
                            }
                          + TableInput   = {
                              + Name              = {
                                  + Ref = "TableName"
                                }
                              + Parameters        = {
                                  + EXTERNAL       = "TRUE"
                                  + numFiles       = "-1"
                                  + "orc.compress" = "SNAPPY"
                                }
                              + PartitionKeys     = [
                                  + {
                                      + Comment = "partition by kind"
                                      + Name    = "kind"
                                      + Type    = "string"
                                    },
                                ]
                              + StorageDescriptor = {
                                  + Columns      = [
                                      + {
                                          + Name = "id"
                                          + Type = "string"
                                        },
                                      + {
                                          + Name = "term"
                                          + Type = "string"
                                        },
                                      + {
                                          + Name = "_projectname"
                                          + Type = "string"
                                        },
                                    ]
                                  + InputFormat  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
                                  + Location     = "s3://gaspi-metadata-20250523065512230500000001/terms-index"
                                  + OutputFormat = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"
                                  + SerdeInfo    = {
                                      + Name                 = "ORC"
                                      + Parameters           = {
                                          + "hive.orc.use-column-names" = "TRUE"
                                          + "orc.column.index.access"   = "FALSE"
                                          + "serialization.format"      = "1"
                                        }
                                      + SerializationLibrary = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
                                    }
                                }
                              + TableType         = "EXTERNAL_TABLE"
                            }
                        }
                      + Type       = "AWS::Glue::Table"
                    }
                }
            }
        )
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms"
        }
      + policy_body   = (known after apply)
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = jsonencode(
            {
              + Parameters = {
                  + DatabaseName = {
                      + Type = "String"
                    }
                  + TableName    = {
                      + Type = "String"
                    }
                }
              + Resources  = {
                  + SBeaconTermsGlueCatalogTable = {
                      + Properties = {
                          + CatalogId    = {
                              + Ref = "AWS::AccountId"
                            }
                          + DatabaseName = {
                              + Ref = "DatabaseName"
                            }
                          + TableInput   = {
                              + Name              = {
                                  + Ref = "TableName"
                                }
                              + Parameters        = {
                                  + EXTERNAL       = "TRUE"
                                  + numFiles       = "-1"
                                  + "orc.compress" = "SNAPPY"
                                }
                              + PartitionKeys     = [
                                  + {
                                      + Comment = "partition by kind"
                                      + Name    = "kind"
                                      + Type    = "string"
                                    },
                                ]
                              + StorageDescriptor = {
                                  + Columns      = [
                                      + {
                                          + Name = "term"
                                          + Type = "string"
                                        },
                                      + {
                                          + Name = "label"
                                          + Type = "string"
                                        },
                                      + {
                                          + Name = "type"
                                          + Type = "string"
                                        },
                                      + {
                                          + Name = "_projectname"
                                          + Type = "string"
                                        },
                                    ]
                                  + InputFormat  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
                                  + Location     = "s3://gaspi-metadata-20250523065512230500000001/terms"
                                  + OutputFormat = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"
                                  + SerdeInfo    = {
                                      + Name                 = "ORC"
                                      + Parameters           = {
                                          + "hive.orc.use-column-names" = "TRUE"
                                          + "orc.column.index.access"   = "FALSE"
                                          + "serialization.format"      = "1"
                                        }
                                      + SerializationLibrary = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
                                    }
                                }
                              + TableType         = "EXTERNAL_TABLE"
                            }
                        }
                      + Type       = "AWS::Glue::Table"
                    }
                }
            }
        )
    }

  # module.sbeacon.aws_cloudfront_cache_policy.api will be created
  + resource "aws_cloudfront_cache_policy" "api" {
      + arn         = (known after apply)
      + default_ttl = 0
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 0
      + min_ttl     = 0
      + name        = "sbeacon-backend-api"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.sbeacon.aws_cloudfront_distribution.api_distribution will be created
  + resource "aws_cloudfront_distribution" "api_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "sbeacon-backend-api"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + default_cache_behavior {
          + allowed_methods          = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id          = (known after apply)
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = 0
          + max_ttl                  = 0
          + min_ttl                  = 0
          + origin_request_policy_id = (known after apply)
          + target_origin_id         = "sbeacon-backend-api"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "https-only"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "sbeacon-backend-api"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.sbeacon.aws_cloudfront_origin_request_policy.api will be created
  + resource "aws_cloudfront_origin_request_policy" "api" {
      + arn  = (known after apply)
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "sbeacon-backend-api"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "allExcept"

          + headers {
              + items = [
                  + "Host",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # module.sbeacon.aws_dynamodb_table.anscestor_terms will be created
  + resource "aws_dynamodb_table" "anscestor_terms" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "term"
      + id               = (known after apply)
      + name             = "sbeacon-Anscestors"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "term"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinic_jobs will be created
  + resource "aws_dynamodb_table" "clinic_jobs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "job_id"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinic-jobs"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "job_id"
          + type = "S"
        }
      + attribute {
          + name = "project_name"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "project_name"
          + name               = "project-name-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_annotations will be created
  + resource "aws_dynamodb_table" "clinical_annotations" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "project_job"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinical-annotations"
      + range_key        = "annotation_name"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "annotation_name"
          + type = "S"
        }
      + attribute {
          + name = "project_job"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be created
  + resource "aws_dynamodb_table" "clinical_variants" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "project_job"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinical-variants"
      + range_key        = "collection_name"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "collection_name"
          + type = "S"
        }
      + attribute {
          + name = "project_job"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be created
  + resource "aws_dynamodb_table" "descendant_terms" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "term"
      + id               = (known after apply)
      + name             = "sbeacon-Descendants"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "term"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be created
  + resource "aws_dynamodb_table" "juptyer_notebooks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-juptyer-notebooks"
      + range_key        = "instanceName"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "instanceName"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be created
  + resource "aws_dynamodb_table" "ontologies" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "sbeacon-Ontologies"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be created
  + resource "aws_dynamodb_table" "project_users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-project-users"
      + range_key        = "uid"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "uid"
          + name               = "uid-index"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + range_key          = "name"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be created
  + resource "aws_dynamodb_table" "projects" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-projects"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be created
  + resource "aws_dynamodb_table" "saved_queries" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-saved-queries"
      + range_key        = "name"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon-dataportal-users-quota will be created
  + resource "aws_dynamodb_table" "sbeacon-dataportal-users-quota" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-users-quota"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Name"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "uid"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.vcfs will be created
  + resource "aws_dynamodb_table" "vcfs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "vcfLocation"
      + id               = (known after apply)
      + name             = "sbeacon-vcfs"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "vcfLocation"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.sbeacon.aws_glue_catalog_database.metadata-database will be created
  + resource "aws_glue_catalog_database" "metadata-database" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "sbeacon_metadata"
      + tags_all     = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + create_table_default_permission (known after apply)
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be created
  + resource "aws_glue_catalog_table" "sbeacon-analyses" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_analyses"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/analyses"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_vcfsampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "aligner"
              + type = "string"
            }
          + columns {
              + name = "analysisdate"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "pipelinename"
              + type = "string"
            }
          + columns {
              + name = "pipelineref"
              + type = "string"
            }
          + columns {
              + name = "variantcaller"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-analyses-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_analyses_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/analyses-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_vcfsampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "aligner"
              + type = "string"
            }
          + columns {
              + name = "analysisdate"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "pipelinename"
              + type = "string"
            }
          + columns {
              + name = "pipelineref"
              + type = "string"
            }
          + columns {
              + name = "variantcaller"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be created
  + resource "aws_glue_catalog_table" "sbeacon-biosamples" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_biosamples"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/biosamples"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosamplestatus"
              + type = "string"
            }
          + columns {
              + name = "collectiondate"
              + type = "string"
            }
          + columns {
              + name = "collectionmoment"
              + type = "string"
            }
          + columns {
              + name = "diagnosticmarkers"
              + type = "string"
            }
          + columns {
              + name = "histologicaldiagnosis"
              + type = "string"
            }
          + columns {
              + name = "measurements"
              + type = "string"
            }
          + columns {
              + name = "obtentionprocedure"
              + type = "string"
            }
          + columns {
              + name = "pathologicalstage"
              + type = "string"
            }
          + columns {
              + name = "pathologicaltnmfinding"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sampleorigindetail"
              + type = "string"
            }
          + columns {
              + name = "sampleorigintype"
              + type = "string"
            }
          + columns {
              + name = "sampleprocessing"
              + type = "string"
            }
          + columns {
              + name = "samplestorage"
              + type = "string"
            }
          + columns {
              + name = "tumorgrade"
              + type = "string"
            }
          + columns {
              + name = "tumorprogression"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-biosamples-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_biosamples_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/biosamples-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosamplestatus"
              + type = "string"
            }
          + columns {
              + name = "collectiondate"
              + type = "string"
            }
          + columns {
              + name = "collectionmoment"
              + type = "string"
            }
          + columns {
              + name = "diagnosticmarkers"
              + type = "string"
            }
          + columns {
              + name = "histologicaldiagnosis"
              + type = "string"
            }
          + columns {
              + name = "measurements"
              + type = "string"
            }
          + columns {
              + name = "obtentionprocedure"
              + type = "string"
            }
          + columns {
              + name = "pathologicalstage"
         
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.